# Proyecto 2 Movies_SQL

In [150]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import csv
pd.set_option('display.max_rows', None) 
pd.set_option('display.max_columns', None) 
import re
import funciones as fun

Lo primero que realizo es la importación de todo lo que creo que voy a necesitar y visualización de las csv que tengo

# 1. Limpieza csv actor:

- Visualización de la información que me da.

- Eliminación de columna last_update ya que no me interesa.

- Concatenación de las columnas first y last name como actor_name.

- ELiminción de un nombre duplicado que luego me daba error en SQL.

In [151]:
da=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/actor.csv', encoding_errors='replace')
da.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [152]:
#da.shape

In [153]:
da=da.drop(columns=['last_update'])

In [154]:
da['actor_name'] = da[['first_name', 'last_name']].agg(' '.join, axis=1)

In [155]:
da.head()

   actor_id first_name     last_name           actor_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [156]:
da=da.drop(columns=['first_name','last_name'])

In [157]:
da.duplicated(subset=['actor_name']).sum()

1

In [158]:
da.actor_name.value_counts().head()

SUSAN DAVIS       2
EWAN GOODING      1
DARYL CRAWFORD    1
GRETA KEITEL      1
JANE JACKMAN      1
Name: actor_name, dtype: int64

In [159]:
da1=da.actor_name

In [160]:
da.actor_name=da1.drop(da1.index[100])

In [161]:
da.actor_name.value_counts().head()

PENELOPE GUINESS    1
KEVIN GARLAND       1
DARYL CRAWFORD      1
GRETA KEITEL        1
JANE JACKMAN        1
Name: actor_name, dtype: int64

In [162]:
da.drop_duplicates().shape==da.shape

True

In [163]:
da.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   actor_name  199 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.2 KB

# 2. Limpieza csv category

- Visualización de la información que me da.

- Eliminación de columna last_update ya que no me interesa.

In [164]:
dc=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/category.csv', encoding_errors='replace')
dc.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [165]:
dc.drop_duplicates().shape==dc.shape

True

In [166]:
dc=dc.drop(columns=['last_update'])

In [167]:
dc.shape

(16, 2)

In [168]:
dc.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.2 KB

# 3. Limpieza csv film

- Visualización de la información que me da.

- Eliminación de columna last_update ya que no me interesa.

- Separación de la columna special features en 4 columnas, por comodidad visual.

In [169]:
df=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/film.csv', encoding_errors='replace')
df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [170]:
df.special_features.unique()

array(['Deleted Scenes,Behind the Scenes', 'Trailers,Deleted Scenes',
       'Commentaries,Behind the Scenes', 'Deleted Scenes', 'Trailers',
       'Commentaries,Deleted Scenes',
       'Trailers,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Behind the Scenes', 'Trailers,Commentaries',
       'Trailers,Behind the Scenes',
       'Commentaries,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Deleted Scenes',
       'Trailers,Commentaries,Deleted Scenes,Behind the Scenes',
       'Behind the Scenes', 'Commentaries'], dtype=object)

In [171]:
df['deleted_scenes'] = df.loc[:, 'special_features']
df['behind_scenes'] = df.loc[:,'deleted_scenes' ]
df['comentaries'] = df.loc[:, 'deleted_scenes']
df['trailers'] = df.loc[:,'deleted_scenes' ]

In [172]:
df.deleted_scenes=df.deleted_scenes.apply(fun.cambio_delate)

In [173]:
#df.head()

In [174]:
df.behind_scenes=df.behind_scenes.apply(fun.cambio_behind)

In [175]:
#df.head()

In [176]:
df.comentaries=df.comentaries.apply(fun.cambio_comen)

In [177]:
#df.head()

In [178]:
df.trailers=df.trailers.apply(fun.cambio_trailers)

In [179]:
#df.head()

In [180]:
df=df.drop(columns=['original_language_id'])

In [181]:
df.drop_duplicates().shape==df.shape

True

In [182]:

df=df.drop(columns=['special_features'])

In [183]:
df=df.drop(columns=['last_update'])

In [184]:
#df.head()

In [185]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  deleted_scenes    1000 non-null   object
 11  behind_scenes     1000 non-null   object
 12  comentaries       1000 non-null   object
 13  trailers          1000 non-null   object
dtypes: float64(2), int64(5), object(7)
memory usage: 562.2 KB

# 4. Limpieza csv inventory

- Visualización de la información que me da.

- Eliminación de columna last_update ya que no me interesa.

In [186]:
di=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/inventory.csv', encoding_errors='replace')
di.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [187]:
di=di.drop(columns=['last_update'])

In [188]:
#di.head()

In [189]:
di.drop_duplicates().shape==di.shape

True

In [190]:
di.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

# 5.Limpieza csv languages

- Visualización de la información que me da.

- Eliminación de columna last_update ya que no me interesa.

In [191]:
dl=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/language.csv', encoding_errors='replace')
dl.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [192]:
dl=dl.drop(columns=['last_update'])

In [193]:
#dl.head()

In [194]:
dl.drop_duplicates().shape==dl.shape

True

In [195]:
dl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

# 6. Limpieza csv old_HDD

- Visualización de la información que me da.

In [196]:
do=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/old_HDD.csv', encoding_errors='replace')
do.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [197]:
do['actor_name'] = do[['first_name', 'last_name']].agg(' '.join, axis=1)

In [198]:
#do.head()

In [199]:
do=do.drop(columns=['first_name','last_name'])

In [200]:
do.head()

                   title  release_year  category_id        actor_name
0       ACADEMY DINOSAUR          2006            6  PENELOPE GUINESS
1   ANACONDA CONFESSIONS          2006            2  PENELOPE GUINESS
2            ANGELS LIFE          2006           13  PENELOPE GUINESS
3  BULWORTH COMMANDMENTS          2006           10  PENELOPE GUINESS
4          CHEAPER CLYDE          2006           14  PENELOPE GUINESS

In [201]:
do.drop_duplicates().shape==do.shape

True

In [202]:
do.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         1000 non-null   object
 1   release_year  1000 non-null   int64
 2   category_id   1000 non-null   int64
 3   actor_name    1000 non-null   object
dtypes: int64(2), object(2)
memory usage: 31.4+ KB

# 7. Limpieza csv rental

- Visualización de la información que me da.

- Eliminación de columna last_update ya que no me interesa.

In [203]:
dr=pd.read_csv('/Users/Ari/desktop/ironhack/Proyecto_Movies_SQL/data/rental.csv', encoding_errors='replace')
dr.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [204]:
dr=dr.drop(columns=['last_update'])

In [205]:
#dr.head()

In [206]:
dr.drop_duplicates().shape==dr.shape

True

In [207]:
dr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

# Mandar datos a SQL

In [208]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\ari\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ari\anaconda3\lib\site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [209]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\ari\anaconda3\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [210]:
from sqlalchemy import create_engine

In [211]:
str_conn='mysql+pymysql://root:Muscleup23@localhost:3306'

cursor=create_engine(str_conn)


cursor.execute('drop database if exists cinema;')

cursor.execute('create database cinema;')

In [212]:
str_conn='mysql+pymysql://root:Muscleup23@localhost:3306/cinema'

cursor=create_engine(str_conn)

In [213]:
da.to_sql(name='actors', con=cursor, if_exists='append', index=False)

200

In [214]:
dc.to_sql(name='category', con=cursor, if_exists='replace', index=False)

16

In [215]:
df.to_sql(name='films', con=cursor, if_exists='replace', index=False)

1000

In [216]:
di.to_sql(name='inventory', con=cursor, if_exists='append', index=False)

1000

In [217]:
dl.to_sql(name='language', con=cursor, if_exists='append', index=False)

6

In [218]:
do.to_sql(name='old_HDD', con=cursor, if_exists='append', index=False)

1000

In [219]:
dr.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

1000

In [220]:
#nombre_tabla='old_HDD'
#columnas=','.join(do.columns)

#for i in range(len(do)):
    #valores=tuple(do.iloc[i].values)
    #insert_query=f'insert into {nombre_tabla} ({columnas}) values {valores};'
    #cursor.execute(insert_query)